Revit 2024 API
IConnector.Shape Property
The shape of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
ConnectorProfileType Shape { get; }
Visual Basic
ReadOnly Property Shape As ConnectorProfileType
	Get
Visual C++
property ConnectorProfileType Shape {
	ConnectorProfileType get ();
}
Remarks
This property is used to retrieve the shape of the connector.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Throw when this connector has no shape.
See Also
IConnector Interface
Autodesk.Revit.DB Namespace